DataProcessors/СозданиеПроизвольногоГрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>СозданиеПроизвольногоГрафика</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ГрафикРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГрафикРаботы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипГрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыГрафиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаГода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/СозданиеПроизвольногоГрафика/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	ТекДата = НачалоГода(ДатаГрафика);
	ДатаНачалаГода = НачалоГода(ДатаГрафика);
	Набор = РегистрыСведений.ГрафикРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.ТипГрафика.Установить(ТипГрафика);
	Набор.Отбор.ДатаНачалаГода.Установить(ТекДата);
	Для каждого СтрокаТаблицы Из ДатыДляНабораЗаписей Цикл
		
		Запись = Набор.Добавить();
		Запись.Дата = СтрокаТаблицы.Дата;
		Запись.ДатаНачалаГода = ДатаНачалаГода;
		Запись.ТипГрафика = ТипГрафика;
		Запись.Значение = СтрокаТаблицы.Значение;
		
		
	КонецЦикла;
	Набор.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КалендарьВыбор(Элемент, ВыбраннаяДата)
	Отбор =  Новый Структура("Дата",ВыбраннаяДата );
	НайденныйСтроки = ДатыДляНабораЗаписей.НайтиСтроки(Отбор);
	Если НайденныйСтроки.Количество()<> 0 Тогда
	
	НайденныйСтроки[0].Значение =  8;
		
	// изменить цвет выбранной даты	
	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДатаГрафикаПриИзменении(Элемент)
	ТекДата = НачалоГода(ДатаГрафика);
	КонецГода = КонецГода(ДатаГрафика);
	Пока ТекДата<=КонецГода Цикл
		НоваяСтрока = ДатыДляНабораЗаписей.Добавить();
		НоваяСтрока.Дата =  ТекДата;
		
		ТекДата = ТекДата+24*3600;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Календарь = НачалоГода(ТекущаяДата());
КонецПроцедуры
